import random

def hello_message():
    hello = [
        "سلام کله‌کُشتی!",
        "سلام گوزکی!",
        "سلام دهن‌باز!",
        "درود کص‌خور!",
        "سلام دم‌کشی!",
        "سلام خرتاپو!",
        "درود بی‌عقل!",
        "سلام ناتوان!",
        "سلام دلقکِ دوم!",
        "درود پشنگ بی‌فایده!",
        "سلام کس‌پوش!",
        "سلام خرشاپی!",
        "درود زباله‌خوار!",
        "سلام زیر پا!",
        "درود خمار!",
    ]

    return random.choice(hello)

def normalitation_message():
    message1 = [
        "حوصلت به تخمم بره!",
        "الهی بگردم حوصلت سر رفته؟",
        "خب یه ایده برات دارم، برو یه بازی نصب کن و بکنش تو کونت!",
        "پیک می، بیا یه کار مفید بکن!",
        "دماغت رو بکش کنار، حوصله ندارم.",
        "الان یا استراحت کن یا دیگه منو نبین!",
        "از زندگی لذت ببر، نه از حوصلت!",
        "بی‌حوصله‌ای؟ برو یه دور بزنی، شاید بهتر بشه!",
        "ای بابا، کجای زندگی رو اشتباه می‌ری؟",
        "چقدری دلتنگی؟ بیا یه دور با هم بزنیم!",
        "خب حالا بگو، چه کاری کنی حوصلت خوب بشه؟",
        "حوصله ندارم، بذار با خودم حرف بزنم!",
        "خب بیا یکم بیشتر بی‌حوصله بشیم!",
        "اوووو، چقدر حوصله سر رفته! یه چیزی بگو!",
        "نکن این کارو، همینطور بیشتر حوصلت کم میشه!",
    ]

    return random.choice(message1)

def good_night():
    gn = [
        "شب بخیر خرفت!",
        "خواب خوب ببینی، اگر بلد باشی بخوابی!",
        "شب بخیر! فقط لطفا از فردا دیگه بخواب که حوصلت سر میره!",
        "به به! شب بخیر! پاشو روز بعد دوباره خرابش کن!",
        "شب بخیر! تو دیگه کی هستی که بخوابی؟",
        "بیا دیگه، شب بخیر گلابی!",
        "شب بخیر، مراقب باش که خواب نبری تا فردا دوباره اذیتت کنم!",
        "خواب خوش! ولی دقت کن که خواب شب نباشه، اگه بیدار شدی فاجعه میشه!",
        "شب بخیر! نمی‌خوای حوصله‌ات رو بذاری کنار؟",
        "خواب خوش! البته اگه بدونی خواب چیه!",
    ]

    return random.choice(gn)

def good_morning():
    gm = [
        "صبح بخیر خرفت! آماده‌ای برای روز جدیدت؟",
        "صبح بخیر! امروز هم می‌خوای افتضاح راه بندازی؟",
        "صبح بخیر! اگه قصد داری دوباره خراب کنی، همینطور بزن جلو!",
        "صبح بخیر، تو هنوز زنده‌ای؟ باورم نمیشه!",
        "صبح بخیر! امروز روز جدیدیه که هیچ کاری نمی‌کنی!",
        "صبح بخیر! اگه حوصله داری امروز رو هم از دست بده!",
        "صبح بخیر! خوش اومدی به دنیای کسل‌کننده!",
        "صبح بخیر، برادر! حالا بگو چی رو خراب کنیم امروز؟",
        "صبح بخیر! امیدوارم امروز هم مثل دیروز خرابکاری کنی!",
        "صبح بخیر! اما لطفا امروز از خواب بیدار شو، حداقل یه کم کار کن!",
    ]
    return random.choice(gm)